In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
# 1. 2차원 표
df = pd.DataFrame(np.arange(20).reshape(4,5),
                  index=list('abce'), columns=list('vwxyz'))
df

    v   w   x   y   z
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
e  15  16  17  18  19

In [6]:
# 2. Dictionary list
dl = [
      {'name': 'James', 'age': 24, 'job':'student'},
      {'name': 'Maria', 'age': 36, 'job':'teacher'},
      {'name': 'Brian', 'age': 30, 'job':'programmer'}
]
df = pd.DataFrame(dl)
df

    name  age         job
0  James   24     student
1  Maria   36     teacher
2  Brian   30  programmer

In [8]:
# 3. 여러개의 리스트
names = ['James', 'Maria', 'Brian']
ages = [24, 36, 30]
jobs = ['student', 'teacher', 'programmer']
df = pd.DataFrame({
    'name': names, 'age': ages, 'job': jobs
})
df

    name  age         job
0  James   24     student
1  Maria   36     teacher
2  Brian   30  programmer

In [15]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [12]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [41]:
iris.keys()

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [14]:
iris.species.value_counts()

setosa        50
virginica     50
versicolor    50
Name: species, dtype: int64

species feature mean std
setosa

In [21]:
iris[iris.species == 'setosa']['sepal_length'].mean()

5.005999999999999

In [42]:
species = iris.species.value_counts().index
keys = iris.keys()[:-1]

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width'], dtype='object')

species 별 길이의 평균과 std값

In [51]:
species = iris.species.unique()
keys = iris.keys()[:-1]

for spec in species:
  for key in keys:
    print(f'{spec}, {key} : mean =  {np.round(iris[iris.species == spec][key].mean(), 1)}\
     std = {np.round(iris[iris.species == spec][key].std(), 1)}')

setosa, sepal_length : mean =  5.0     std = 0.4
setosa, sepal_width : mean =  3.4     std = 0.4
setosa, petal_length : mean =  1.5     std = 0.2
setosa, petal_width : mean =  0.2     std = 0.1
versicolor, sepal_length : mean =  5.9     std = 0.5
versicolor, sepal_width : mean =  2.8     std = 0.3
versicolor, petal_length : mean =  4.3     std = 0.5
versicolor, petal_width : mean =  1.3     std = 0.2
virginica, sepal_length : mean =  6.6     std = 0.6
virginica, sepal_width : mean =  3.0     std = 0.3
virginica, petal_length : mean =  5.6     std = 0.6
virginica, petal_width : mean =  2.0     std = 0.3

In [53]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [56]:
species_list, feature_list, mean_list, std_list = [], [], [], []

for species in iris.species.unique():
  for feature in iris.columns[:-1]:
    s = iris[iris.species == species][feature]
    species_list.append(species)
    feature_list.append(feature)
    mean_list.append(np.round(s.mean(), 2))
    std_list.append(np.round(s.std(), 2))

In [57]:
df = pd.DataFrame( {
    'species': species_list,
    'feature': feature_list,
    'mean': mean_list,
    'std': std_list
})
df

       species       feature  mean   std
0       setosa  sepal_length  5.01  0.35
1       setosa   sepal_width  3.43  0.38
2       setosa  petal_length  1.46  0.17
3       setosa   petal_width  0.25  0.11
4   versicolor  sepal_length  5.94  0.52
5   versicolor   sepal_width  2.77  0.31
6   versicolor  petal_length  4.26  0.47
7   versicolor   petal_width  1.33  0.20
8    virginica  sepal_length  6.59  0.64
9    virginica   sepal_width  2.97  0.32
10   virginica  petal_length  5.55  0.55
11   virginica   petal_width  2.03  0.27

In [59]:
df.set_index(['species', 'feature'], inplace=True)

In [60]:
df

                         mean   std
species    feature
setosa     sepal_length  5.01  0.35
           sepal_width   3.43  0.38
           petal_length  1.46  0.17
           petal_width   0.25  0.11
versicolor sepal_length  5.94  0.52
           sepal_width   2.77  0.31
           petal_length  4.26  0.47
           petal_width   1.33  0.20
virginica  sepal_length  6.59  0.64
           sepal_width   2.97  0.32
           petal_length  5.55  0.55
           petal_width   2.03  0.27